zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/periph/PERI_DMA.h
/*
** ###################################################################
**     Processors:          MC56F84441VLF
**                          MC56F84442VLH
**                          MC56F84451VLF
**                          MC56F84452VLH
**                          MC56F84462VLH
**                          MC56F84540VLF
**                          MC56F84543VLH
**                          MC56F84550VLF
**                          MC56F84553VLH
**                          MC56F84565VLK
**                          MC56F84567VLL
**                          MC56F84587VLL
**                          MC56F84763VLH
**                          MC56F84766VLK
**                          MC56F84769VLL
**                          MC56F84786VLK
**                          MC56F84789VLL
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 2.0 (2021-02-06)
**         Initial version.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F84441VLF))
#include "MC56F84441_COMMON.h"
#elif (defined(CPU_MC56F84442VLH))
#include "MC56F84442_COMMON.h"
#elif (defined(CPU_MC56F84451VLF))
#include "MC56F84451_COMMON.h"
#elif (defined(CPU_MC56F84452VLH))
#include "MC56F84452_COMMON.h"
#elif (defined(CPU_MC56F84462VLH))
#include "MC56F84462_COMMON.h"
#elif (defined(CPU_MC56F84540VLF))
#include "MC56F84540_COMMON.h"
#elif (defined(CPU_MC56F84543VLH))
#include "MC56F84543_COMMON.h"
#elif (defined(CPU_MC56F84550VLF))
#include "MC56F84550_COMMON.h"
#elif (defined(CPU_MC56F84553VLH))
#include "MC56F84553_COMMON.h"
#elif (defined(CPU_MC56F84565VLK))
#include "MC56F84565_COMMON.h"
#elif (defined(CPU_MC56F84567VLL))
#include "MC56F84567_COMMON.h"
#elif (defined(CPU_MC56F84587VLL))
#include "MC56F84587_COMMON.h"
#elif (defined(CPU_MC56F84763VLH))
#include "MC56F84763_COMMON.h"
#elif (defined(CPU_MC56F84766VLK))
#include "MC56F84766_COMMON.h"
#elif (defined(CPU_MC56F84769VLL))
#include "MC56F84769_COMMON.h"
#elif (defined(CPU_MC56F84786VLK))
#include "MC56F84786_COMMON.h"
#elif (defined(CPU_MC56F84789VLL))
#include "MC56F84789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_CHANNEL_REQUEST_SOURCE_T_)
#define DMA_CHANNEL_REQUEST_SOURCE_T_
/*!
 * @brief DMA channel request source
 *
 * Enumeration member bitfield:
 *   BIT8~BIT15: DMA Channel Number.
 *   BIT0~BIT7: DMA Channel Input.
 */
typedef enum _dma_channel_request_source
{
    kDmaCH0_SCI0_TE                 = 0x0000U,     /**< SCI0 Transmitter Empty */
    kDmaCH0_SCI1_RF                 = 0x0001U,     /**< SCI1 Receiver Full */
    kDmaCH0_SPI0_RF                 = 0x0002U,     /**< SPI0 Receiver Full */
    kDmaCH0_IIC0_ipd_Req            = 0x0004U,     /**< IIC0 DMA Req */
    kDmaCH0_TMRA0_CP                = 0x0005U,     /**< TMRA0 Capture */
    kDmaCH0_TMRA0_CMPLD1orTMRA1_CMPLD2 = 0x0006U,  /**< TMRA0 Compare1 or TMRA1 Compare2 */
    kDmaCH0_TMRB0_CP                = 0x0007U,     /**< TMRB0 Capture */
    kDmaCH0_TMRB0_CMPLD1orTMRB1_CMPLD2 = 0x0008U,  /**< TMRB0 Compare1 or TMRB1 Compare2 */
    kDmaCH0_PWMA3_CP                = 0x0009U,     /**< Submodule 3 Capture DMA Req */
    kDmaCH0_ADCA_ES                 = 0x000CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH0_ADCB_ES                 = 0x000DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH0_XBAR_DSC0               = 0x000FU,     /**< XBAR DMA Req 0 */
    kDmaCH1_SCI1_TE                 = 0x0100U,     /**< SCI1 Transmitter Empty */
    kDmaCH1_SCI0_RF                 = 0x0101U,     /**< SCI0 Receiver Full */
    kDmaCH1_SPI0_TE                 = 0x0102U,     /**< SPI0 Transmitter Empty */
    kDmaCH1_IIC1_ipd_Req            = 0x0104U,     /**< IIC1 DMA Req */
    kDmaCH1_TMRA1_CP                = 0x0105U,     /**< TMRA1 Capture */
    kDmaCH1_TMRA0_CMPLD2orTMRA1_CMPLD1 = 0x0106U,  /**< TMRA0 Compare2 or TMRA1 Compare1 */
    kDmaCH1_TMRB1_CP                = 0x0107U,     /**< TMRB1 Capture */
    kDmaCH1_TMRB0_CMPLD2orTMRB1_CMPLD1 = 0x0108U,  /**< TMRB0 Compare2 or TMRB1 Compare1 */
    kDmaCH1_PWMA2_CP                = 0x0109U,     /**< Submodule 2 Capture DMA Req */
    kDmaCH1_ADCA_ES                 = 0x010CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH1_ADCB_ES                 = 0x010DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH1_XBAR_DSC1               = 0x010FU,     /**< XBAR DMA Req 1 */
    kDmaCH2_SCI0_RF                 = 0x0201U,     /**< SCI0 Receiver Full */
    kDmaCH2_SPI0_RF                 = 0x0202U,     /**< SPI0 Receiver Full */
    kDmaCH2_IIC0_ipd_Req            = 0x0204U,     /**< IIC0 DMA Req */
    kDmaCH2_TMRA2_CP                = 0x0205U,     /**< TMRA2 Capture */
    kDmaCH2_TMRA2_CMPLD1orTMRA3_CMPLD2 = 0x0206U,  /**< TMRA2 Compare1 or TMRA3 Compare2 */
    kDmaCH2_TMRB2_CP                = 0x0207U,     /**< TMRB2 Capture */
    kDmaCH2_TMRB2_CMPLD1orTMRB3_CMPLD2 = 0x0208U,  /**< TMRB2 Compare1 or TMRB3 Compare2 */
    kDmaCH2_PWMA1_CP                = 0x0209U,     /**< Submodule 1 Capture DMA Req */
    kDmaCH2_PWMA0_WRorPWMA1_WRorPWMA2_WRorPWMA3_WR = 0x020BU, /**< SubModule0 Value write DMA Req or SubModule1 Value write DMA Req or SubModule2 Value write DMA Req or SubModule3 Value write DMA Req */
    kDmaCH2_ADCA_ES                 = 0x020CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH2_ADCB_ES                 = 0x020DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH2_XBAR_DSC2               = 0x020FU,     /**< XBAR DMA Req 2 */
    kDmaCH3_SCI0_TE                 = 0x0300U,     /**< SCI0 Transmitter Empty */
    kDmaCH3_SPI0_TE                 = 0x0302U,     /**< SPI0 Transmitter Empty */
    kDmaCH3_IIC1_ipd_Req            = 0x0304U,     /**< IIC1 DMA Req */
    kDmaCH3_TMRA3_CP                = 0x0305U,     /**< TMRA3 Capture */
    kDmaCH3_TMRA2_CMPLD2orTMRA3_CMPLD1 = 0x0306U,  /**< TMRA2 Compare2 or TMRA3 Compare1 */
    kDmaCH3_TMRB3_CP                = 0x0307U,     /**< TMRB3 Capture */
    kDmaCH3_TMRB2_CMPLD2orTMRB3_CMPLD1 = 0x0308U,  /**< TMRB2 Compare2 or TMRB3 Compare1 */
    kDmaCH3_PWMA0_CP                = 0x0309U,     /**< Submodule 0 Capture DMA Req */
    kDmaCH3_ADCA_ES                 = 0x030CU,     /**< ADCA(Cyclic) End of Scan */
    kDmaCH3_ADCB_ES                 = 0x030DU,     /**< ADCB(Cyclic) End of Scan */
    kDmaCH3_XBAR_DSC3               = 0x030FU,     /**< XBAR DMA Req 3 */
    kDmaCH0_ADCC_EC                 = 0x000EU,     /**< ADCC(SAR) End of Conv. */
    kDmaCH1_ADCC_EC                 = 0x010EU,     /**< ADCC(SAR) End of Conv. */
    kDmaCH2_ADCC_EC                 = 0x020EU,     /**< ADCC(SAR) End of Conv. */
    kDmaCH3_ADCC_EC                 = 0x030EU,     /**< ADCC(SAR) End of Conv. */
    kDmaCH1_DAC_FIFO                = 0x010BU,     /**< 12bit DAC FIFO Water Mark */
    kDmaCH3_DAC_FIFO                = 0x030BU,     /**< 12bit DAC FIFO Water Mark */
    kDmaCH0_SPI1_TE                 = 0x0003U,     /**< SPI1 Transmitter Empty */
    kDmaCH0_PWMB0_CP                = 0x000AU,     /**< Submodule 0 Capture DMA Req */
    kDmaCH0_PWMB0_WRorPWMB1_WRorPWMB2_WRorPWMB3_WR = 0x000BU, /**< SubModule0 Value write DMA Req or SubModule1 Value write DMA Req or SubModule2 Value write DMA Req or SubModule3 Value write DMA Req */
    kDmaCH1_SPI1_RF                 = 0x0103U,     /**< SPI1 Receiver Full */
    kDmaCH1_PWMB1_CP                = 0x010AU,     /**< Submodule 1 Capture DMA Req */
    kDmaCH2_SCI2_TE                 = 0x0200U,     /**< SCI2 Transmitter Empty */
    kDmaCH2_PWMB2_CP                = 0x020AU,     /**< Submodule 2 Capture DMA Req */
    kDmaCH3_SCI2_RF                 = 0x0301U,     /**< SCI2 Receiver Full */
    kDmaCH3_PWMB3_CP                = 0x030AU,     /**< Submodule 3 Capture DMA Req */
    kDmaCH2_SPI2_TE                 = 0x0203U,     /**< SPI2 Transmitter Empty */
    kDmaCH3_SPI2_RF                 = 0x0303U,     /**< SPI2 Receiver Full */
} dma_channel_request_source_t;
#endif /* DMA_CHANNEL_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


